Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: Once the engineers have resolved the identified issues, the OSRB Chair will request a new audit to confirm that the resolved issues do not exist anymore.
ja: 検出された問題をエンジニアが解決すると、OSRB チェアは、解決された問題が本当にもう存在していないことを確認するための新しい監査を要求します。

source: It’s more complex than one might think to reference exactly the right revision of the right license.
ja: 正しいライセンスの正しい版を正確に参照することは、想像以上に難しいものです。

source: In a future paper, we will discuss in details the roles and responsibilities of each individual or team involved in ensuring FOSS compliance.
ja: FOSS コンプライアンスの徹底に関わる人々やチームの役割と責任については、別のホワイトペーパーで詳しく説明する予定です。

source: Initial release of the Self-Assessment Checklist
ja: 自己診断チェックリストの初期リリース◆◆

source: Commercial tools
ja: 商用ツール

source: OSS Open Source Software
ja: OSS Open Source Software (オープン ソース ソフトウェア)

source: OBS supports the entire workflow from building binaries from source, over packaging binaries, configuration files, documentation, etc. to creating images for entire distributions.
ja: OBS は、ソースからバイナリをビルドし、バイナリ、コンフィギュレーション ファイル、ドキュメンテーションなどをパッケージングし、ディストリビューション向けのイメージを作成するまでの全ワークフローをサポートします。

source: Defining buckets can be as simple as specifying a regular expression or as complicated as a script or program to determine if a file is in a bucket.
ja: バケットの定義の難易度をたとえて言うなら、正規表現の記述と同じくらいシンプル、あるいは、バケットの中にファイルがあるかどうかチェックするスクリプトやプログラムと同じぐらい複雑です。

source: When a new operating system is presented, it typically won’t have this property, so there has to be a mechanism for the platform owner to validate and install a KEK even before the system is booted.
ja: プラットフォーム オーナーが新たな OS を追加する場合、それにはこのような属性が備わっていないため、システムをブートする前に、プラットフォーム オーナーが鍵交換鍵を認証およびインストールするメカニズムが必要です。

source: This white paper is a first in a series that will focus on the various practical aspects of ensuring free and open source software compliance in the enterprise.
ja: このホワイトペーパーは、企業におけるフリー & オープン ソース ソフトウェアのコンプライアンス (法令・契約などの順守) を実行する実務的側面に重点を置いたシリーズの第一弾です。

source: Execute test suites after the build has finished.
ja: ビルドの終了後にテスト スイートを実行する。

source: For instance, if you are just starting to develop a product that includes FOSS and do not have any compliance infrastructure yet, your immediate concern may be, for example, establishing a compliance team, process and policy, tools and automation, and training your employees.
ja: たとえば、FOSS を含む製品を開発しようとしているが、まだコンプライアンス基盤がまったく存在しない場合、おそらくすぐに懸案事項となるのは、コンプライアンス チーム、プロセスとポリシー、ツールと自動化、従業員のトレーニングの確立などでしょう。

source: Law Department
ja: 法務部門

source: Furthermore, the paper highlighted examples of compliance failures, provided recommendations on how to avoid them and prevent them from happening again.
ja: また、コンプライアンス違反の例を取り上げ、その回避方法と再発防止方法について提言しました。

source: Source-to-Image Workflow
ja: ソースからイメージへのワークフロー

source: Dual Boot
ja: デュアル ブート

source: Automatic builds are triggered on every check-in of a modified source Package and on every change of a dependency.
ja: 修正されたソース パッケージがチェックインされたり、依存関係が変更されたりするたびに、自動ビルドがトリガーされます。

source: FOSSology does not dispense legal advice.
ja: FOSSology は法務的な助言を提供しない。

source: Communicating compliance
ja: コンプライアンスについて良好なコミュニケーションを維持する

source: According to a 2008 VDC report, Linux is used by over 18% of embedded developers, making it the most popular embedded operating system.
ja: 2008 VDC レポートによれば、Linux は 18% 以上の組込みシステム開発者によって使用されており、最も需要の多い組込み OS です。

source: The course provides practical, easy-to-understand guidance on license compliance to organizations building products that incorporate free and open source software.
ja: このコースは、FOSS を利用した製品を開発する組織を対象に、ライセンス コンプライアンスについての実践的でわかりやすいガイダンスを提供します。

source: The Linux Foundation offers a variety of free informational resources including white papers from noted industry experts.
ja: The Linux Foundation は、業界の著名なエキスパートによるホワイトペーパーをはじめ、さまざまな無償の情報資料を提供しています。

source: Diffs and patches are created automatically even when the developer uses sources that are checked-out locally to his/her development system.
ja: 開発者の開発システムにローカルでチェックアウトされたソースを彼らが使用した場合でも、差分ファイルとパッチが自動作成されます。

source: Go Mobile
ja: モバイルを使う

source: Fully Satisfied / Partly Satisfied / Not Satisfied
ja: 充分満足/ある程度満足/不満

source: Review and approvalof open source use
ja: オープン ソースの使用に関する調査と承認

source: Ensure that the FOSS training is part of the employee's professional development plan.
ja: FOSS トレーニングを従業員の専門性向上計画の一環として徹底する。

source: After a project is compiled the output files need to be packaged using a packaging format suitable for the target distribution.
ja: プロジェクトをコンパイルしたら、ターゲット ディストリビューションに適したパッケージ形式で、出力ファイルをパッケージする必要があります。

source: The paper concluded with a number of lessons learned from the various non-compliance cases.
ja: 最後に、さまざまなコンプライアンス違反の例から得られた多くの教訓で締めくくりました。

source: a) Code scans are used to prepare the bill of materials wherever source code is available.
ja: a) ソース コードを利用可能な場合には、コード スキャンを使用して BoM を用意する。

source: A Changing Business Environment
ja: 変化するビジネス環境

source: Report
ja: 報告

source: FIGURE 1.
ja: 図 1.

source: The Policy area addresses corporate policy to encourage use of OSS at the same time protecting the company's business interests.
ja: 「ポリシー」の領域は、事業利益を確保すると同時に、OSS の利用を促進するよう、企業の方針を検討します。

source: - Conduct design, architecture and code reviews
ja: 設計、アーキテクチャ、およびコード レビューを管理する

source: The core team, often called the Open Source Review Board (OSRB), consists of representatives from engineering and product teams, one or more legal counsels, and the Compliance Officer.
ja: コア チームは、通常、オープンソース調査委員会 (Open Source Review Board; OSRB) と呼ばれ、エンジニアリング & 製品担当チームの代表者、1 人以上のリーガル カウンセラー、およびコンプライアンス オフィサーで構成されます。

source: This paper examines a sample end-to- end compliance process.
ja: ここでは、詳細なコンプライアンス プロセス例を取り上げます。

source: This enables the Platform Owner to take control of the platform securely by installing their own platform key or allowing the Operating System install process to do so.
ja: そうすれば、プラットフォーム オーナーは、各自のプラットフォーム鍵をインストールするか、あるいは OS のインストール プロセスに任せることで、プラットフォームを安全に管理することができます。

source: Executive Support
ja: エグゼクティブ サポート

source: Process Adherence Audits
ja: プロセス順守の監査

source: Review & Approval
ja: 調査と承認

source: Project management tool
ja: プロジェクト管理ツール (Project management tool)

source: Source Code Scanning and Identification Tool
ja: ソース コード スキャン/識別ツール (Source Code Scanning and Identification Tool)

source: If companies are non-compliant with FOSS license obligations, they are not licensed and thus can be sued by the copyright holder for copyright infringement and can potentially lose the right to use and distribute the software in question.
ja: FOSS ライセンス義務を順守しない企業は、ライセンスを取得できず、著作権を侵害したとして、著作権所有者に告訴される可能性があります。また、対象となるソフトウェアを使用および配布する権利を失う可能性があります。

source: One of the initial challenges with compliance programs is to find out exactly what FOSS is in use, how it is licensed and where in your products or platform it is being used.
ja: コンプライアンス プログラムが取り組むべき最初の課題の 1 つは、どの FOSS を使用しているか、それがどのようにライセンスされているか、そしてあなたの製品またはプラットフォームのどこに使用されているかを正確に見極めることです。

source: If your company or organization has a tool you would like listed, please contact the Open Compliance Program at compliance@linuxfoundation.org.
ja: このページに掲載したいツールをお持ちの企業や組織の方は、下記のオープン コンプライアンス プログラム担当までご連絡ください。 compliance@linuxfoundation.org (英語)

source: i)Training objectives are set.
ja: i) トレーニングの目的を設定する。

source: As part of meeting the FOSS license obligations and depending on the FOSS license in questions, some licenses impose the obligation of providing a change log that describes the changes that were introduced to the FOSS package (such as those licensed under the GPL).
ja: FOSS ライセンス義務を履行する上で、対象の FOSS ライセンスによっては、その FOSS パッケージに対して行われた変更を記述した変更記録を提供する必要があります (GPL の下でライセンスされたものなど)。

source: Enter FOSS Compliance
ja: FOSS コンプライアンスの励行

source: On August 26, 2008, the Software Freedom Law Center published a guide on how to be compliant with the GNU General Public License (GPL) and related licenses.
ja: 2008 年 8 月 26 日、Software Freedom Law Center は GNU General Public License (GPL) と関連ライセンスの順守方法に関するガイドを公開しました。

source: The WebUI is a human-to-machine interface based on Ruby/Rails.
ja: WebUI は Ruby/Rails をベースにした、人と機械の (human-to-machine) インタフェースです。

source: FIGURE 2.
ja: 図 2.

source: If you’re interested in participating in the SPDX(TM) Working Group, send an email to one of the chairpersons below, or check out the website http://spdx.org.
ja: SPDX(TM) ワーキング グループへの参加にご興味のある方は、下記のチェアパーソンの一人に電子メールをお送りくださるか、http://spdx.org サイトをご覧ください。

source: Please see below for pointers to various core areas in MeeGo.
ja: MeeGo 関連の主なサイトは、下記のとおりです。

source: In addition, the tool offer a license policy framework that enables FOSS Compliance Officers to define combinations of licenses and linkage methods that are to be flagged if found as a result of running the tool.
ja: また、FOSS コンプライアンス オフィサーがライセンスの混在やリンク方法に関するポリシーを設定でき、ツールがポリシー非準拠を発見した場合にはアラートを出す仕組みを持っています。

source: - A discovery of FOSS being used (without proper authorization) via a scan
ja: (適切な承認を受けずに) 使用されている FOSS がスキャンで検出される

source: c) Software license agreements include appropriate terms and conditions concerning OSS.
ja: c) ソフトウェア ライセンス同意書に、OSS に関する適切な契約条件が含まれている。

source: Design review and code inspections to analyze the interaction between FOSS, proprietary code and third party software components
ja: 設計をレビューし、FOSS、プロプライエタリ コード、およびサード パーティ ソフトウェア コンポーネント間の相互関係を解析するためにコード検査を行う

source: Project management fundamentals are applied to managing compliance projects and compliance team activities.
ja: プロジェクト管理の基本が、コンプライアンス プロジェクトやコンプライアンス チームの作業の管理に適用されている。

source: The Open Compliance Program also includes a new data exchange standard so companies and their suppliers can easily report software information in a standard way.
ja: オープン コンプライアンス プログラムには、新しいデータ交換標準も含まれているため、企業とサプライヤーは共通の方法で簡単にソフトウェア情報を交換できます。

source: SPDX(TM) has, in fact, become one of the main pillars.
ja: 実際に SPDX(TM) は、このプログラムの大きな柱の一つになりました。

source: Middleware
ja: ミドルウェア

source: There are several challenges in maintaining open source compliance, similar to those faced when establishing baseline compliance.
ja: オープン ソース コンプライアンスを維持するには、ベースライン コンプライアンスの確立時に直面したのと同様な各種の課題が存在します。

source: This right is enabled because control of the PK permits the platform owner to generate a new KEK for their modified operating system and install it in the signature database.
ja: この権利は、プラットフォーム鍵の管理者であるプラットフォーム オーナーが、変更された OS 用の新しい鍵交換鍵を生成し、署名データベースにインストールすることで有効になります。

source: - Translate FOSS license information and notices in the product documentation
ja: 製品ドキュメントに記載されている FOSS のライセンス情報と告知を翻訳する

source: It is important to acknowledge that compliance is not just a legal exercise.
ja: コンプライアンスとは単なる法的訓練ではないことを認識することが重要です。

source: Contactcompliance@linuxfoundation.org with your comments.
ja: 連絡先はこちらです。<br /> compliance@linuxfoundation.org with your comments.

source: The Linux Foundation has compiled a quick and easy guide to getting started with this exciting area of computing.
ja: The Linux Foundation は、この刺激的なコンピューター分野に手早く簡単に取りかかるためのガイドを作成しました。

source: Proprietary + FOSS
ja: プロプライエタリ + FOSS

source: Reviews of FOSS usage as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「FOSS 使用の調査」ステップ

source: Compliance requirements
ja: コンプライアンスの要件

source: The Linux Foundation offers hands-on training from compliance experts for individuals and companies responsible for achieving compliance with open source licenses and establishing an open source compliance program, as well as for those who simply want to learn more about compliance.
ja: The Linux Foundation では、オープン ソース ライセンス準拠を履行する必要があり、オープン ソース コンプライアンス プログラムを確立する必要がある人々や企業向けに、あるいはコンプライアンスについて詳しく学習したい方のために、コンプライアンスの専門家による実践的なトレーニングを提供しています。

source: c)The organization uses past records of OSS review and approval as an aid when reviewing new OSS cases for approval.
ja: c) 組織は、承認を求められた新しい OSS 使用事例を調査する際、参考として、過去の OSS の調査と承認の記録を使用する。

source: Click here to view all of our Open Compliance tools.
ja: オープン コンプライアンス ツールをすべて見る

source: FIGURE 3.
ja: 図 3.

source: As a workgroup of the Linux Foundation, FOSSBazaar is dedicated to helping organizations properly govern the implementation and deployment of FOSS.
ja: FOSSBazaar は、LF のワークグループとして、FOSS (フリー&オープン ソース ソフトウェア) の実装・導入を適切に管理する組織を支援することを目的としています。

source: Mechanisms are used to determine the OSS content of a product release and the files that must be subjected to compliance analysis.
ja: コンプライアンス分析を行う必要のある製品の OSS コンテンツやファイルを特定するために、一定のメカニズムが使用されていること。

source: The goal is to illustrate a sample process and discuss which tools are being used in which steps in the process.
ja: ここでは、サンプル プロセスの図を使って、コンプライアンス プロセスのどの段階でどのツールを使用するかを説明します。

source: Software Compliance
ja: ソフトウェア コンプライアンス

source: A two-day comprehensive coverage of the compliance process, including working sessions with the compliance team on how to adapt compliance activities to the organization’s needs.
ja: ◆◆コンプライアンス プロセスを包括的に説明する 2 日間のコース。コンプライアンス活動を各組織のニーズにどう適応させるかについて、コンプライアンス チームと討論したりします。

source: There are great benefits to having an end-to-end compliance process that is simple, communicated and well understood within the organization
ja: コンプライアンス プロセスが簡潔で、組織内で十分に伝達され、正しく理解されることで、以下のような大きなメリットが得られます。

source: Build service instances can build natively for the architecture of their host system or use cross build toolchains to build for other architectures.
ja: ビルド サービスのインスタンスは、そのホスト システムのアーキテクチャ用のネイティブ ビルドも可能ですが、クロス ビルド ツールチェーンを使用して、他のアーキテクチャ用にビルドすることもできます。

source: There are a number of tools that can be very useful in a FOSS compliance program:
ja: 以下は、FOSS コンプライアンス プログラムで非常に有用なツールです。

source: a)Support teams (e.g. supply chain, documentation, IT) are trained in OSS fundamentals.
ja: サポート チーム (サプライチェーン、ドキュメンテーション、IT など) は、OSS の基礎知識について教育を受けていること。

source: After installation the fossology repository you create will be empty, although you can find a read only fossology demo server at http://repo.fossology.org.
ja: http://repo.fossology.org にはリードオンリーの fossology デモ サーバーがありますが、インストール後に作成される fossology リポジトリは空になります。

source: The output of the BoM difference checker would be the list of new components, retired components, and modified components.
ja: BoM 比較ツールが出力する結果は、新しいコンポーネント、使わなくなったコンポーネント、および変更されたコンポーネントのリストです。

source: Some Microsoft proprietary install files (e.g. .msi) cannot be unpacked on linux servers.
ja: Microsoft 社製の一部のインストール ファイル (.msi など) を Linux サーバー上で解凍できない。

source: The Self-Assessment Checklist will be launched in 4th Quarter 2010.
ja: この自己診断チェックリストは2010年中に公開される予定です。

source: A source code and license identification tool to identify source code included in the build system and their licenses
ja: ビルド システムに含まれているソース コードとそれらのライセンスを識別するためのソース コード & ライセンス識別ツール

source: The public interface is limited to certain operations such as read access only to publicly available repositories and projects.
ja: パブリック インタフェースを利用する場合は、「パブリックに利用可能なリポジトリやプロジェクトに対するリード アクセスのみ」などの操作制限があります。

source: The Code Janitor, capable of scanning code comments for terms and keywords that should be cleaned up or removed prior to public code release.
ja: 用語やキーワードに関するコメントなど、最終的なコード リリース前に削除するべきコードをスキャンするコード管理 (Code Janitor) ツール。

source: Policy
ja: ポリシー

source: Engineering teams must respond promptly to provide information requested by the OSRB and be prompt in closing internal compliance tickets.
ja: エンジニアリング チームは、OSRB から要求された情報を迅速に提供し、社内のコンプライアンス チケットを速やかにクローズする必要があります。

source: The internal package owner, the OSRB engineering representative and the FOSS expert usually perform the architecture review.
ja: 通常は、社内のパッケージ所有者、OSRB エンジニアリング部門代表者、および FOSS エキスパートが、アーキテクチャ レビューを行います。

source: The current most adopted development model is the multi-source development model (Figure 2).
ja: 現在最も採用されている開発モデルは、マルチソース開発モデルです (図 2)。

source: It must be possible to take the entire build system and copy/move it from one computer/server to another and the new instance will again yield the exact same results.
ja: あるコンピューターやサーバーのビルド システム全体を、別のコンピューターｙサーバーへコピー/移動でき、新しいインスタンスでも全く同じ結果を得ることができなければなりません。

source: Course Outline for LF281Executive Review of Open Source Compliance
ja: コース概要

source: FIGURE 4.
ja: 図 4.

source: Metadata
ja: メタデータ

source: All OSRB members have reviewed the compliance ticket, and the OSRB has completed the architecture review and linkage analysis.
ja: すべての OSRB メンバーがコンプライアンス チケットの調査を完了し、OSRB がアーキテクチャ レビューとリンク解析を完了している。

source: Confirm you have received the report
ja: 照会を受けたことを確認する

source: Software Package Data Exchange™ (SPDX™) Workgroup
ja: Software Package Data Exchange™ (SPDX™) ワークグループ

source: Registering the approved software component in the software inventory system
ja: ソフトウェア インベントリ システムに承認済みソフトウェア コンポーネントを登録する

source: Such judgments can best be made by members of the organization who are fully aware of the business unit's product development process, product roadmap, product architecture, and company culture.
ja: このような評価は、その事業体の製品開発プロセス、製品ロードマップ、製品アーキテクチャ、企業カルチャーなどを熟知した組織メンバーが行うのが理想的です。

source: Protecting product differentiation while complying with FOSS licensing obligations
ja: FOSS のライセンス義務を順守すると同時に、製品の差別化を維持する

source: We have therefore scrambled to have a beta release of Version 1.0 of the spec available in time for the announcement of the program.
ja: このため、このオープン ソース コンプライアンス プログラムの発表に合わせて、バージョン 1.0 のベータ版を公開しました。

source: All personnel involved in the development, QA, release and maintenance of software, need to understand the compliance program and their company's policies and procedures.
ja: ソフトウェアの開発、QA、リリース、およびメンテナンスに関わるすべての社員は、そのコンプライアンス プログラムのほか、自社のポリシーと手続きについて理解する必要があります。

source: The Self-Assessment Checklist is constructed using at least two concepts from well-established models of process maturity such as the Software Engineering Institute's Capability Maturity Model:
ja: この自己診断チェックリストは、確立されたプロセス成熟度モデルの少なくとも 2 つの概念を採用しています。すなわち、Software Engineering Institute の能力成熟度モデル (Capability Maturity Model: CMM) の次の概念です。

source: The OSRB Chair performs this review using an automated tool.
ja: OSRB チェアは、自動ツールを使用してこの調査を行います。

source: Attribution notices and code offers
ja: 帰属告知とコードの提供

source: Thus the need for a common approach to sharing information about software packages and their related content has never been greater.
ja: このため、ソフトウェア パッケージや関連コンテンツの情報を共有するための共通のアプローチを求める声が高まっています。

source: - Drive all compliance activities
ja: すべてのコンプライアンス活動を推進する

source: Investigate Kernel Features
ja: カーネルの機能を調査する

source: Software license proliferation - there are nearly 2000 software licenses for software freely available on the Internet - is a major headache for software development organizations that want to speed development with software component re-use as well as for companies redistributing software packages as part of their products.
ja: ソフトウェア ライセンスの種類は急増しており、インターネットで自由に使用できるソフトウェアには、約 2000 種類のソフトウェア ライセンスが存在します。これは、ソフトウェア コンポーネントを再利用して開発の効率化を狙うソフトウェア開発組織や、製品にソフトウェア パッケージを組み込んで再配布する企業にとって大きな頭痛の種です。

source: OBS keeps track of the dependencies and automatically triggers rebuilds of depending entities, may it be Subprojects or Packages, if a dependency has changed hence maintaining consistency.
ja: OBS は依存関係を記録し、依存関係が変化すると一貫性を維持し、依存するエンティティ (サブプロジェクトやパッケージ) のリビルドを自動的にトリガーします。

source: File bugs or feature requests via bugzilla: http://bugs.linuxfoundation.org
ja: bugzilla でバグを報告または機能をリクエスト: http://bugs.linuxfoundation.org

source: IT managers care, software development managers who want to know what’s in the code their developers are writing care, and executives at companies buying software packages care.
ja: たIT マネージャーも、開発者が記述したコードに何が入っているかを知りたいソフトウェア開発マネージャーも、ソフトウェア パッケージを購入している企業の上層部も関心を持っています。

source: Projects can be collaboration entities for multiple users and every OBS user has his/her own Home Project.
ja: プロジェクトは複数ユーザーに対応するコラボレーション エンティティにもなり、各 OBS ユーザーは自分専用のホーム プロジェクトを持ちます。

source: Using FOSSology
ja: FOSSology の使用

source: FIGURE 5.
ja: 図 5.

source: c)Sufficient staffing is provided to the OSRB to achieve turnaround time on submissions that supports product development cycles.
ja: c) 製品開発サイクルに合致した短いサブミッション応答時間を実現できるよう、OSRB に十分な要員が提供されていること。

source: Messaging
ja: メッセージング

source: ILLUSTRATION OF THE ARCHITECTURE OF A TRADITIONAL SOFTWARE PLATFORM THAT RELIES ON PROPRIETARY AND 3RD PARTY COMMERCIALLY- LICENSED SOFTWARE BUILDING BLOCKS3
ja: 従来のソフトウェア プラットフォームのアーキテクチャ - サードパーティの商用ライセンスによるプロプライエタリなソフトウェア構築ブロックに依存

source: Superimpose that on the overall ubiquity of software in products from cars to handsets to power plants and it becomes clear that open source code is being channeled through countless supply chains in almost every industry.
ja: 車からハンドセットや発電所に至るまで、ありとあらゆる製品がソフトウェアを使用していることを考えると、オープン ソース コードは、ほぼすべての産業の無数のサプライ チェーンに行き渡っています。

source: Provides one-day comprehensive coverage of the compliance process.
ja: 1 日のトレーニング。コンプライアンス プロセスに関する包括的なコース。

source: It is highly recommended to re-scan the source code after Engineering has resolved the issue to get a confirmation that Engineering has removed the GPL source code and replaced it with proprietary source code.
ja: 技術担当者が問題を解決したら、ソース コードを再スキャンし、技術担当者が GPL ソース コードを削除したこと、およびプロプライエタリ ソース コードで置換したことを必ず確認してください。

source: FOSS initiatives and projects provide companies with a vehicle to accelerate innovation through collaboration with the global community of FOSS developers.
ja: FOSS プロジェクトは、グローバルな FOSS 開発者コミュニティの協力を通して、技術革新を加速する手段を提供します。

source: Several actions can trigger a discovery and an audit for software component (Figure 4):
ja: さまざまな活動を契機として、ソフトウェア コンポーネントの検出や監査が始まります (図 4)。

source: OBS itself provides Web-based client based on Ruby/Rails, accessible through https://build.opensuse.org, and an extensible command line client osc written in Python which is similar to the Subversion client.
ja: OBS 自体は、Ruby/Rails をベースにした Web ベース クライアントを提供し、https://build.opensuse.org サイトや、Python で記述された拡張可能コマンド ライン クライアント osc (Subversion クライアントに類似) を介してアクセスできます。

source: The list of common challenges related to establishing and maintaining compliance programs and how to overcome these challenges and ensure successful compliance program implementation
ja: コンプライアンス プログラムの確立と維持に関わる一般的な課題、およびこれらの課題を克服し、成功するコンプライアンス プログラムを確実に実装する方法

source: Making UEFI Secure Boot work with Open Platforms
ja: オープン プラットフォームにおける UEFI Secure Boot への対応

source: Code re-use is a great way to speed up development, but it can introduce license conflicts over time.
ja: コードの再利用は、開発を高速化するための優れた方法ですが、時が経つうちにライセンスの矛盾を招く恐れがあります。

source: Options available include live onsite training in addition to instructor-led live remote training.
ja: インストラクターが指導するライブ リモート トレーニングに加え、ライブ オンサイト トレーニングも提供されています。

source: Use a stable distribution as a starting point either through interlinking an OBS instance with another OBS providing the distribution e.g. build.meego.com or build.opensuse.org, download on demand from another OBS using RPM or DEB packages, or manually importing packages.
ja: ディストリビューションを提供する他の OBS (build.meego.com や build.opensuse.org など) に OBS インスタンスを連結し、RPM や DEB パッケージを使用して、他の OBS からオンデマンドでダウンロードするか、手動でパッケージをインポートすることにより、まず安定したディストリビューションを使用する。

source: To that effect, companies need to implement an end-to-end FOSS management infrastructure that will allow them to:
ja: そのためには、企業は徹底した FOSS 管理基盤を実装し、以下の処理を実行する必要があります。

source: The OSEC is responsible for setting the FOSS strategy, reviewing and approving licensing proprietary source code under a FOSS license.
ja: OSEC は、FOSS 戦略を設定し、FOSS ライセンス下におけるプロプライエタリ ソース コードのライセンシングについてレビューおよび承認する責任を負います。

source: Automatically build accompanying documentation such as release notes, help packages, API descriptions, etc.
ja: リリース ノート、ヘルプ パッケージ、API 仕様書などの添付書類を自動的にビルドする。

source: A compliance program should include mechanisms for ongoing monitoring of adherence to the program and for enforcing policies, procedures, and guidelines throughout the company.
ja: コンプライアンス プログラムには、そのプログラムの順守を継続的に監視し、ポリシー、手続き、およびガイドラインを全社的に徹底させるメカニズムが含まれるべきです。
